Revit 2026 API

# EnergyDataSettingsCheckRangeOfSillHeight Method

---

Checks that the sill height is greater than or equal to zero.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CheckRangeOfSillHeight(
	double sillHeight
)
```
```vb
Public Shared Function CheckRangeOfSillHeight (
	sillHeight As Double
) As Boolean
```
```cpp
public:
static bool CheckRangeOfSillHeight(
	double sillHeight
)
```
```fsharp
static member CheckRangeOfSillHeight :
        sillHeight : float -> bool
```

#### Parameters

sillHeight Double
     The sill height to be checked.

#### Return Value

Boolean True if the sill height falls is greater than or equal to zero, false otherwise.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace